Tekla Open API Reference for Tekla Structures 2025
Contour Fields
The Contour type exposes the following members.
Fields
Name | Description
MAX_CONTOUR_POINTS
 The maximum number of contour points that is typically valid in Tekla Structures.
MIN_CONTOUR_POINTS
 The minimum number of contour points that is typically valid in Tekla Structures.
Top
See Also
Reference
Contour Class
Tekla.Structures.Model Namespace